app/Controllers/Fisica.php

    public function index()
    {
        $pessoasModel = new \App\Models\PessoasModel();
        $data['pessoas'] = $pessoasModel->findAll();
---
SELECT *
FROM `pessoa`

    public function inserir()
    {
        $data['titulo'] = 'Exibindo a lista de pessoas';
        $data['acao'] = 'Inserir';
        $data['msg'] = '';

        if($this->request->getMethod() === 'post') {
            $pessoasModel = new \App\Models\PessoasModel();
            $pessoasModel->set('nomepessoa', $this->request->getPost('nomepessoa'));
            $pessoasModel->set('cpf', $this->request->getPost('cpf'));

            if($pessoasModel->insert()) {
---
INSERT INTO `pessoa` (`nomepessoa`, `cpf`) VALUES ('Rodrigo', '999.999.999-99')

    public function excluir($cpf)
    {
        if(is_null($cpf)) {
            $this->session->setFlashdata('msg', 'Pessoa não encontrada');
            return redirect()->to(base_url('fisica'));
        }
        $pessoasModel = new \App\Models\PessoasModel();
        if($pessoasModel->delete($cpf)) {
---
DELETE FROM `pessoa`
WHERE `id` IN ('109')