app/Controllers/Produtos.php

    public function inserir()
    {

        $data['acao'] = 'Inserir';
        $data['msg'] = '';
        $data['erros'] = '';
        if($this->request->getMethod() === 'post'){
            $produtoModel = new \App\Models\ProdutoModel();
            $dadosProduto = $this->request->getPost();

            if($produtoModel->insert($dadosProduto)) {
                $data['msg'] = 'Produto inserido com sucesso';
            }
            else {
                $data['msg'] = "Erro ao inserir produto";
                $data['erros'] = $produtoModel->errors();
            }
        }

        $produto = new \App\Models\ProdutoModel();
        $listaProduto = $produto->findAll();
---
INSERT INTO `produto` (`nomeproduto`, `valor`, `pessoa_id`) VALUES ('Teclado', '20', '106')
SELECT *
FROM `produto`